InformationRegisters/бит_НастройкиДоступностиВариантовОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиДоступностиВариантовОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВариантНастройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_НастройкиДоступностиВариантовОтчетов/Forms/ФормаЗаписиУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет кэш значений доступный на сервере и клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	// Заполним список типов для быстрого выбора составных типов.
	ИзмеренияРегистра = Метаданные.РегистрыСведений.бит_НастройкиДоступностиВариантовОтчетов.Измерения;
	МассивТипов  = ИзмеренияРегистра.Пользователь.Тип.Типы();
	СписокТиповПользователь 	= бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	МассивТипов  = ИзмеренияРегистра.ВариантНастройка.Тип.Типы();
	СписокТиповВариантНастройка = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
           	
	фКэшЗначений = Новый Структура;
	фКэшЗначений.Вставить("СписокТиповПользователь"     ,СписокТиповПользователь);
	фКэшЗначений.Вставить("СписокТиповВариантНастройка" ,СписокТиповВариантНастройка);
	      
КонецПроцедуры // ЗаполнитьКэшЗначений() 

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.бит_НастройкиДоступностиВариантовОтчетов;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКэшЗначений();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Запись.ИспользоватьПриОткрытии Тогда
		бит_ОтчетыВызовСервера.СброситьИспользоватьПриОткрытии(Запись.ВариантНастройка, Запись.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "НачалоВыбора" поля ввода "ВариантНастройка".
//
&НаКлиенте
Процедура ВариантНастройкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтаФорма
	                                                   , Элемент
	                                                   , Запись
	                                                   , "ВариантНастройка"
													   , фКэшЗначений.СписокТиповВариантНастройка
													   , СтандартнаяОбработка);
													   
КонецПроцедуры // ВариантНастройкаНачалоВыбора()

// Процедура - обработчик события "Очистка" поля ввода "ВариантНастройка".
//
&НаКлиенте
Процедура ВариантНастройкаОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры // ВариантНастройкаОчистка()

// Процедура - обработчик события "НачалоВыбора" поля ввода "Пользователь".
//
&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтаФорма
	                                                   , Элемент
	                                                   , Запись
	                                                   , "Пользователь"
													   , фКэшЗначений.СписокТиповПользователь
													   , СтандартнаяОбработка);
													   
КонецПроцедуры // ПользовательНачалоВыбора()

// Процедура - обработчик события "Очистка" поля ввода "Пользователь".
//
&НаКлиенте
Процедура ПользовательОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры // ПользовательОчистка()

// Процедура - обработчик события "ПриИзменении" флажка "Просмотр".
//
&НаКлиенте
Процедура ПросмотрПриИзменении(Элемент)
	
	Если Не Запись.Просмотр Тогда	
		Запись.Изменение 			   = Ложь;	
	    Запись.ИспользоватьПриОткрытии = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПросмотрПриИзменении()

// Процедура - обработчик события "ПриИзменении" флажка "Изменение".
//
&НаКлиенте
Процедура ИзменениеПриИзменении(Элемент)
	
	Если Запись.Изменение Тогда	
		Запись.Просмотр = Истина;	
	КонецЕсли;
	
КонецПроцедуры // ИзменениеПриИзменении()

&НаКлиенте
Процедура ИспользоватьПриОткрытииПриИзменении(Элемент)
	
	Если Запись.ИспользоватьПриОткрытии Тогда
		Запись.Просмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры // ИспользоватьПриОткрытииПриИзменении()

#КонецОбласти
